import { CommentType } from '../types/comment';

const fullOfferComments:CommentType[] = [
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6822',
    comment: 'We loved it so much, the house, the veiw, the location just great.. Highly reccomend :)',
    date: '2024-01-11T21:00:00.471Z',
    rating: 1,
    user: {
      userName: 'Christina',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/9.jpg',
      isPro: true
    }
  },
  {
    id: '76d0e170-6454-4216-8a6c-ded830b66167',
    comment: 'The room was spacious and clean. The pool looked nothing like the photos and desparately needs a clean. The sauna and spa were closed for lunar new year holiday.',
    date: '2024-10-08T21:00:00.471Z',
    rating: 3,
    user: {
      userName: 'Isaac',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/8.jpg',
      isPro: false
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6822',
    comment: 'Ставлю 10 звезд! Отличная, просторная, чистая и очень уютная квартира. Есть все необходимое для комфортного проживания. Очень удобное месторасположение, экотропа до Азау и Чегета, магазин. Девочки в поддержке очень отзывчивые и быстро отвечают, все возникающие вопросы решили оперативно! Высший класс!',
    date: '2024-12-11T21:00:00.471Z',
    rating: 5,
    user: {
      userName: 'Михаил',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/7.jpg',
      isPro: true
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6823',
    comment: 'Все было отлично. О-очень уютная квартира, шампунь, гель для душа, чоко-пай и многое другое. Главное в деталях 👍 мы искушённые и требовательные путешественники и ваша квартира в числе лучших. Спасибо за сервис и доверие 🤝',
    date: '2024-09-11T21:00:00.471Z',
    rating: 4,
    user: {
      userName: 'София',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/6.jpg',
      isPro: true
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6824',
    comment: 'проживала по данному адресу с 4.12 по 11.12.24. Спасибо Александру и Яне за мое комфортное проживание.Заселили сразу по прибытии в 11 утра. Квартира небольшая, но уютная. В комнате большая двухспальная кровать с удобным матрацем, диванчик, стол и два стула, гардероб, комод с зеркалом, телевизор. Мебель новая.На кухне газовая плита, микроволновка, стиральная машина и необходимая кухонная утварь- чайник, сковородки,кастрюли, посуда для приема пищи. В ванной теплый пол, автономное отопление и водоснабжение. В наличии полотенца, тапочки, фен, утюг, сушилка для белья. Расположение жилья удобное.Рядом Магнит, Пятёрочка, небольшой рынок, столовая, автобусная остановка. До колоннады 5 мин неспешным шагом. Так же рядом Никольский храм, мечеть, музей „Крепость„ , музей Ярошенко. Хозяева всегда на связи, на возникающие вопросы реагируют сразу. Рекомендую данное жилье для проживания одному или вдвоем.',
    date: '2023-11-11T21:00:00.471Z',
    rating: 2,
    user: {
      userName: 'Виктория',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/5.jpg',
      isPro: false
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6825',
    comment: 'Доброжелательные хозяева.Квартирка маленькая,но все необходимое есть, сделан ремонт стильно и со вкусом .Расположение отличное.',
    date: '2024-06-11T21:00:00.471Z',
    rating: 5,
    user: {
      userName: 'Тимофей',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/4.jpg',
      isPro: true
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6826',
    comment: 'Хорошая,уютная,чистая и комфортная квартира!Самое то,что бы отдохнуть с семьёй от домашней рутины!Всё понравилось!Вернёмся ещё!!!',
    date: '2024-11-12T21:00:00.471Z',
    rating: 3,
    user: {
      userName: 'Варвара',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/3.jpg',
      isPro: true
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6827',
    comment: 'местоположение и коммуникация идеальны. жаль, что умывальника в ванной нету и сиденье на унитазе не закреплено',
    date: '2024-11-12T22:00:00.471Z',
    rating: 3,
    user: {
      userName: 'Милана',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/2.jpg',
      isPro: false
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6828',
    comment: 'Мы были на этом квартира все классно чисто уютно девочка Марина приятно приветливые хозяин квартиры классный не в одном квартире не видела таких условий как они чай сахар кофе печенье для пиши тоже есть всё всему советую 👍👍👍👍',
    date: '2024-11-11T17:00:00.471Z',
    rating: 5,
    user: {
      userName: 'Василиса',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/1.jpg',
      isPro: true
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6829',
    comment: 'Прекрасная квартира. Всё понравилось. Удобное расположение.',
    date: '2024-03-11T21:00:00.471Z',
    rating: 2,
    user: {
      userName: 'Дарья',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/3.jpg',
      isPro: false
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6840',
    comment: 'Квартира хорошая, все чисто. Мебель хорошая. Приветливая хозяйка. Все очень понравилось. Понравилось еще местоположение. Рядом магазины, кафе, общественный транспорт.',
    date: '2024-03-22T21:00:00.471Z',
    rating: 2,
    user: {
      userName: 'Ярослав',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/2.jpg',
      isPro: true
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6841',
    comment: 'Все отлично, как и всегдаНе первый раз останавливаемся там',
    date: '2024-03-22T21:01:00.471Z',
    rating: 4,
    user: {
      userName: 'Марк',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/4.jpg',
      isPro: false
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6842',
    comment: 'Квартира хорошая, очень чистая, уютная. Все удобства есть. Спасибо будем еще брать',
    date: '2022-11-11T21:00:00.471Z',
    rating: 4,
    user: {
      userName: 'Иван',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/5.jpg',
      isPro: false
    }
  },
  {
    id: '40d941a5-e381-4bbc-9835-8be1142e6843',
    comment: 'Доброго времени суток. Приехала из Сочи на поезде. Надежда меня встретила и проводила в квартиру, очень приятно. Для жизни в квартире есть всё. Очень удобное расположение самой квартиры. Приеду ещё раз ',
    date: '2023-12-11T21:00:00.471Z',
    rating: 2,
    user: {
      userName: 'Дмитрий',
      avatarUrl: 'https://16.design.htmlacademy.pro/static/avatar/6.jpg',
      isPro: true
    }
  },
];

export default fullOfferComments;
